app/controllers/attendees_controller.rb

	def create
		@attendee = Attendee.new(params[:attendee])

		respond_to do |format|
			if @attendee.save
---
INSERT INTO "attendees" ("address", "campus_address", "campus_name", "campus_phone", "created_at", "date_of_birth", "email", "gender", "job_title", "name", "office_address", "office_name", "office_phone", "phone", "place_of_birth", "religion", "training_location", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)