app/controllers/orders_controller.rb

	def create
		@order = Order.new(params[:order])
		@order.status = "pending"
		@order.attendee = current_attendee
		respond_to do |format|
			if @order.save
---
INSERT INTO "attendees" ("address", "campus_address", "campus_name", "campus_phone", "created_at", "date_of_birth", "email", "gender", "job_title", "name", "office_address", "office_name", "office_phone", "order_id", "phone", "place_of_birth", "religion", "training_location", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
INSERT INTO "orders" ("created_at", "payment_type", "status", "updated_at") VALUES (?, ?, ?, ?)  [["created_at", Sat, 09 Feb 2013 19:40:35 UTC +00:00], ["payment_type", "credit-card"], ["status", nil], ["updated_at", Sat, 09 Feb 2013 19:40:35 UTC +00:00]]

	def complete
		@order = Order.find(params[:order_id])
---
SELECT "orders".* FROM "orders" WHERE "orders"."id" = ? LIMIT 1  [["id", "9"]]